In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\sangi\onedrive\documents\anaconda3\envs\datascience\lib\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.26.0 in c:\users\sangi\onedrive\documents\anaconda3\envs\datascience\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sangi\onedrive\documents\anaconda3\envs\datascience\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\sangi\onedrive\documents\anaconda3\envs\datascience\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\sangi\onedrive\documents\anaconda3\envs\datascience\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\sangi\onedrive\documents\anaconda3\envs\datascience\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [9]:
import pandas as pd

data = [1, 2, 3, 4]
ser = pd.Series(data, index =[1, 2, 3, 4])

ser = pd.Series(data, index =['a', 'b', 'c', 'd'], name = "Roll Number")

print(ser)
print("the type of panda series is: ", type(ser))
ser.to_excel("series_example.xlsx")

a    1
b    2
c    3
d    4
Name: Roll Number, dtype: int64
the type of panda series is:  <class 'pandas.core.series.Series'>

In [2]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl

   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   ---------------------------------------- 2/2 [openpyxl]

Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

In [ ]:
#create dictionary
data = {
"subject": ["science", "maths", "social"],
"marks": [80, 99, 45]
}

print(data)

print(type(data))

df = pd.DataFrame(data)
print(df)
print(type(df))
df.to_csv("c.csv")
#df.to_excel("f.xlsx")
#df.to_json("f.json")

{'subject': ['science', 'maths', 'social'], 'marks': [80, 99, 45]}
<class 'dict'>
   subject  marks
0  science     80
1    maths     99
2   social     45
<class 'pandas.core.frame.DataFrame'>

In [9]:
#access one or specified rows
print(df.loc[[0,2]])

   subject  marks
0  science     80
2   social     45

In [10]:
df[0:2]

   subject  marks
0  science     80
1    maths     99

In [11]:
#access column
df['subject']

0    science
1      maths
2     social
Name: subject, dtype: object

In [10]:
df = pd.read_csv(r'C:\Users\sangi\ds_ashad\dummy_data.csv')

print(df)

       Name   Age          City  Score Passed Department
0     Alice  25.0      New York   85.6   True         HR
1       Bob  30.0   Los Angeles   90.4   True         IT
2   Charlie  35.0       Chicago    NaN  False    Finance
3     David  40.0       Houston   88.9   True  Marketing
4       Eva  22.0       Phoenix   92.3   True      Sales
5     Frank  27.0  Philadelphia   81.0  False         IT
6     Grace  29.0   San Antonio   89.7   True         HR
7     Helen   NaN     San Diego   84.5   True        NaN
8       Ivy  24.0        Dallas   79.8  False    Finance
9      Jack  26.0      San Jose   88.2   True  Marketing
10    Karen  34.0        Austin    NaN   True      Sales
11      Leo  31.0       Seattle   77.5  False         HR
12     Mona   NaN        Denver   91.3   True         IT
13    Nancy  28.0        Boston   83.7   True    Finance
14    Oscar  36.0         Miami   88.9  False  Marketing
15     Paul  32.0           NaN   82.5  False      Sales
16   Quincy  23.0       Atlanta   86.4   True         IT
17   Rachel  21.0       Detroit    NaN   True         HR
18      Sam   NaN     Nashville   87.1    NaN    Finance
19     Tina  29.0       Orlando   80.9   True  Marketing

In [7]:
df.head(3)

      Name   Age         City  Score Passed Department
0    Alice  25.0     New York   85.6   True         HR
1      Bob  30.0  Los Angeles   90.4   True         IT
2  Charlie  35.0      Chicago    NaN  False    Finance

In [8]:
df.tail(5)

      Name   Age       City  Score Passed Department
15    Paul  32.0        NaN   82.5  False      Sales
16  Quincy  23.0    Atlanta   86.4   True         IT
17  Rachel  21.0    Detroit    NaN   True         HR
18     Sam   NaN  Nashville   87.1    NaN    Finance
19    Tina  29.0    Orlando   80.9   True  Marketing

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        20 non-null     object
 1   Age         17 non-null     float64
 2   City        19 non-null     object
 3   Score       17 non-null     float64
 4   Passed      19 non-null     object
 5   Department  19 non-null     object
dtypes: float64(2), object(4)
memory usage: 1.1+ KB

In [10]:
df.describe()

             Age      Score
count  17.000000  17.000000
mean   28.941176  85.805882
std     5.297058   4.365128
min    21.000000  77.500000
25%    25.000000  82.500000
50%    29.000000  86.400000
75%    32.000000  88.900000
max    40.000000  92.300000

In [11]:
df['Age']

0     25.0
1     30.0
2     35.0
3     40.0
4     22.0
5     27.0
6     29.0
7      NaN
8     24.0
9     26.0
10    34.0
11    31.0
12     NaN
13    28.0
14    36.0
15    32.0
16    23.0
17    21.0
18     NaN
19    29.0
Name: Age, dtype: float64